NACA0005-RBF/case0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6; //2; //one period

deltaT          0.000520833; //0.125; //quarter period

writeControl    timeStep;

writeInterval   240; //3840;

purgeWrite      16;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forcesCoeffs
    {
        type                forceCoeffs;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        log                 true;
        patches             (wall);
        pName               p;
        UName               U;
        rhoName             rhoInf;
        rhoInf              1000;
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        CofR                (0. 0. 0.);
        pitchAxis           (0 0 1);
        magUInf             0.0635;
        lRef                0.064;
        Aref                0.064;
    }
}

// ************************************************************************* //
