NACA0005-RBF/case0/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
 Caelus nextrelease
 Web:      www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontSAndBack
    {
        type            empty;
        nFaces          28400;
        startFace       28200;
    }
    inletOutlet
    {
        type            patch;
        nFaces          200;
        startFace       56600;
    }
    wall
    {
        type            wall;
        nFaces          200;
        startFace       56800;
    }
)

// ************************************************************************* //
