NACA0005-RBF/case0/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libRBFMotionSolver.so" );

solver RBFMotionSolver;

RBFMotionSolverCoeffs
{

    solidBodyMotionFunction multiMotion;
    multiMotionCoeffs
    {
        // Order of the transformations is important
        // applied successively in reverse order

        translation
        {
            solidBodyMotionFunction oscillatingLinearMotion;

            oscillatingLinearMotionCoeffs
            {
                omega       3.1415926535;
                amplitude   (0 0.048 0);
                phase       1.570796327;
                offset      (0 -0.048 0);
            }
        }

        rotation
        {
            solidBodyMotionFunction oscillatingRotatingMotion;

            oscillatingRotatingMotionCoeffs
            {
                origin      (0 0.048 0);
                omega       3.1415926535;
                amplitude   (0 0 30);
            }
        }

    }

    movingPatches ( wall );

    staticPatches ( inletOutlet );

    coarseningRatio 5;

    includeStaticPatches   no;
    frozenInterpolation    yes;

    interpolation
    {
        RBF  IMQB;
        focalPoint (0.032 0.0 0.000128);
        innerRadius 0.256;
        outerRadius 1.4;
        polynomials true;

        W2Coeffs
        {
            radius     1.0;
        }
        TPSCoeffs
        {
            radius     5.0;
        }
        GaussCoeffs
        {
            radius     1;
        }
        IMQBCoeffs
        {
            radius     0.001;
        }
    }
}


// ************************************************************************* //
