NACA0005-RBF/case0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
/*
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        SSGS;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration off;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
*/
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        SSGS;
            nPreSweeps      0;
            nPostSweeps     2;
            cacheAgglomeration off;
            agglomerator    faceAreaPair;
            nCellsInCoarsestLevel 10;
            mergeLevels     1;
        }
        tolerance       1e-12;
        relTol          0.1;
        maxIter         100;
        minIter         1;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0.0;
    }

    "(U|k|omega|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-12;
        relTol          0.1;
        maxIter         10;
        minIter         1;
    }

    "(U|k|omega|nuTilda)Final"
    {
        $U;
        tolerance       1e-12;
        relTol          0.1;
    }

}

PIMPLE
{
    nOuterCorrectors 40;
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;

    correctPhi false;
    turbOnFinalIterOnly false;
    checkMeshCourantNo true;

    residualControl
    {
        p
        {
            tolerance  1e-6;
            relTol     0;
        }
     }
}

relaxationFactors
{
    fields
    {
        p 0.3;
        pFinal 1;
    }

    equations
    {
        "U|k|omega|nuTilda"  0.7;
        "(U|k|omega|nuTilda)Final" 1;
    }

}

cache
{
    grad(U);
}


// ************************************************************************* //
